html/intepreter/lazy_evalutor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>延时求值器</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">延时求值器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org497ed20">延时求值器</a>
<ul>
<li><a href="#org5ae0c5f">正则序</a></li>
<li><a href="#org9c6c5b7">实现</a>
<ul>
<li><a href="#org93bb2e9">修改 eval</a></li>
<li><a href="#org35c33ce">修改 apply</a></li>
<li><a href="#org2b41f73">修改 eval-if</a></li>
<li><a href="#orgfbc198d">修改驱动循环</a></li>
<li><a href="#org012695b">槽</a>
<ul>
<li><a href="#orgaf886af">记忆槽</a></li>
</ul>
</li>
<li><a href="#orgb58b7d2">测试</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a1480a">应用</a>
<ul>
<li><a href="#org16aa959">流</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>正则序</b> ：把参数求值推迟到实际需要时，也称为 <b>惰性求值</b> 
</p>

<p>
Scheme 采用的是 <span class="underline">应用序</span> 求值，过程应用前完成所有参数求值：
</p>

<p>
考虑下面过程:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">try</span> a b<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= a 0<span style="color: #696969;">)</span> 1 b<span style="color: #696969;">))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(try 0 (/ 1 0)) ;Division by zero signalled by /.</span>
</pre>
</div>

<pre class="example">
  在 Scheme 里求值 (try 0 (/ 1 0)) 会出错，而实际上 b 的值没用到
</pre>

<p>
另一个需要正则序的例子：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">unless</span> condition usual-value exceptional-value<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> condition exceptional-value usual-value<span style="color: #696969;">))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define a 10)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define b 2)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(unless (= b 0)</span>
<span style="color: #5f9ea0; font-style: italic;">;;         </span><span style="color: #5f9ea0; font-style: italic;">(/ a b)</span>
<span style="color: #5f9ea0; font-style: italic;">;;         </span><span style="color: #5f9ea0; font-style: italic;">(begin (display "exception: returning 0")</span>
<span style="color: #5f9ea0; font-style: italic;">;;                </span><span style="color: #5f9ea0; font-style: italic;">0))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; exception: returning 0</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">Value: 5</span>
</pre>
</div>

<pre class="example">
  无论是否出现异常条件，exceptional-value 都会在应用 unless 之前求值

  因此无论是否异常，都会打印出错信息
</pre>

<div id="outline-container-org497ed20" class="outline-2">
<h2 id="org497ed20">延时求值器</h2>
<div class="outline-text-2" id="text-org497ed20">
</div>
<div id="outline-container-org5ae0c5f" class="outline-3">
<h3 id="org5ae0c5f">正则序</h3>
<div class="outline-text-3" id="text-org5ae0c5f">
<ul class="org-ul">
<li>对一个过程和它的一个参数，如果过程要求 <b>该参数在进入过程体前先行完成求值</b> ，称这一过程对该参数是 <span class="underline">严格</span> 的</li>
<li>如果不要求其完成求值，则说这一过程对该参数是 <span class="underline">非严格</span> 的</li>
</ul>

<p>
能将过程的某些参数定义为非严格的也很有用。比如：cons（或任何数据结构的构造函数）。非严格参数可以在不知道数据结构某些部分的情况下使用该数据结构， <span class="underline">流模型</span> 就是这样的结构
</p>
<pre class="example">
     在纯的应用序语言里：每个过程对它的每个参数都是严格的

     在纯的正则序语言里：每个复合过程对其每个参数都是非严格的，基本过程对其参数可以是严格的或者非严格的

     存在这样的语言，其中程序员可以控制所定义过程对各参数的严格性
</pre>

<p>
接下来将实现一个正则序语言，其语法形式与 Scheme 语言一样：
</p>
<ul class="org-ul">
<li>所有 <span class="underline">复合过程的参数</span> 都采用 <span class="underline">惰性求值</span></li>
<li><span class="underline">基本过程</span> 仍采用 <span class="underline">应用序</span></li>
</ul>
</div>
</div>
<div id="outline-container-org9c6c5b7" class="outline-3">
<h3 id="org9c6c5b7">实现</h3>
<div class="outline-text-3" id="text-org9c6c5b7">
<p>
为此要修改已有的求值器，但只需修改与 <span class="underline">过程应用</span> 有关的结构：
</p>
<ol class="org-ol">
<li>先检查过程的参数是否 <b>需要立即求值</b></li>
<li>需要延时的对象不求值，而是为它 <b>建一个槽</b> ( <span class="underline">thunk</span> )，其中 <b>封装着求值该表达式所需的信息</b> （ <span class="underline">表达式本身</span> 和 <span class="underline">相应的求值环境</span> ）</li>
</ol>

<p>
对 <b>入槽表达式的求值</b> 称为 <span class="underline">强迫</span> ，需要值时去强迫它。有几种情况：
</p>
<ul class="org-ul">
<li><b>基本过程</b> 的 <span class="underline">参数</span></li>
<li><b>条件表达式的谓词</b></li>
<li><b>复合</b> 过程的 <span class="underline">运算符</span></li>
</ul>

<pre class="example">
     考虑是否将槽定义为带记忆的，第一次求值记录得到的值，这是一个设计选择！！！
</pre>

<p>
下面采用带记忆的槽，这样实现可能更高效
</p>
</div>
<div id="outline-container-org93bb2e9" class="outline-4">
<h4 id="org93bb2e9">修改 eval</h4>
<div class="outline-text-4" id="text-org93bb2e9">
<p>
<span class="underline">eval</span> 中的 <span class="underline">application?</span> 子句修改：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">eval</span> exp env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>self-evaluating? exp<span style="color: #696969;">)</span> exp<span style="color: #696969;">)</span> 
        <span style="color: #696969;">((</span>variable? exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>lookup-variable-value exp env<span style="color: #696969;">))</span> 
        <span style="color: #696969;">((</span>quoted? exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>text-of-quotation exp<span style="color: #696969;">))</span>
        <span style="color: #696969;">((</span>assignment? exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>eval-assignment exp env<span style="color: #696969;">))</span> 
        <span style="color: #696969;">((</span>definition? exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>eval-definition exp env<span style="color: #696969;">))</span> 
        <span style="color: #696969;">((</span>if? exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>eval-if exp env<span style="color: #696969;">))</span> 
        <span style="color: #696969;">((</span>lambda? exp<span style="color: #696969;">)</span> 
         <span style="color: #696969;">(</span>make-procedure <span style="color: #696969;">(</span>lambda-parameters exp<span style="color: #696969;">)</span> 
                         <span style="color: #696969;">(</span>lambda-body exp<span style="color: #696969;">)</span>
                         env<span style="color: #696969;">))</span>
        <span style="color: #696969;">((</span>begin? exp<span style="color: #696969;">)</span> 
         <span style="color: #696969;">(</span>eval-sequence <span style="color: #696969;">(</span>begin-actions exp<span style="color: #696969;">)</span> env<span style="color: #696969;">))</span> 
        <span style="color: #696969;">((</span>cond? exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>eval <span style="color: #696969;">(</span>cond-&gt;if exp<span style="color: #696969;">)</span> env<span style="color: #696969;">))</span> 
        <span style="color: #696969;">((</span>application? exp<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span>apply <span style="color: #696969;">(</span>actual-value <span style="color: #696969;">(</span>operator exp<span style="color: #696969;">)</span> env<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#24378;&#21046;&#27714;&#20540; &#8220;&#22797;&#21512;&#36807;&#31243;&#30340;&#36816;&#31639;&#31526;&#8221; </span>
                <span style="color: #696969;">(</span>operands exp<span style="color: #696969;">)</span>
                env<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span>
         <span style="color: #696969;">(</span>error <span style="color: #deb887;">"Unknown expression type -- EVAL"</span> exp<span style="color: #696969;">))))</span>
</pre>
</div>

<ul class="org-ul">
<li>直接把未求值的运算对象表达式送给 apply（前面实现中，是把求值之后的实际参数送给 apply）</li>
</ul>
<pre class="example">
      这里把当前环境送给 apply，是因为它可能需要构造参数槽，而参数槽需要携带表达式的求值环境

</pre>
<p>
需要实际参数的值时就 <b>强迫求值</b> ：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">actual-value</span> exp env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>force-it <span style="color: #696969;">(</span>eval exp env<span style="color: #696969;">)))</span> 
</pre>
</div>
</div>
</div>
