src/intepreter/lazy_evalutor.org
*** 修改 apply 
    由于现在来自 _eval_ 的是未求值的运算对象，在送给 *基本过程之前需要求出这些表达式的值* ：

    #+BEGIN_SRC scheme
  (define (apply procedure arguments env)
    (cond ((primitive-procedure? procedure)
	   (apply-primitive-procedure
	    procedure
	    (list-of-arg-values arguments env)))  ; 强迫求值“基本过程所有参数”
	  ((compound-procedure? procedure)
	   (eval-sequence
	    (procedure-body procedure)
	    (extend-environment
	     (procedure-parameters procedure)
	     (list-of-delayed-args arguments env) ; 延时求值“复合过程所有参数”
	     (procedure-environment procedure))))
	  (else
	   (error
	    "Unknown procedure type -- APPLY" procedure))))
    #+END_SRC

    增加两个辅助过程：
    #+BEGIN_SRC scheme
  (define (list-of-arg-values exps env)
    (if (no-operands? exps)
	'()
	(cons (actual-value (first-operand exps) env) ;; 强迫求值
	      (list-of-arg-values (rest-operands exps)
				  env))))
    #+END_SRC

    #+BEGIN_SRC scheme
  (define (list-of-delayed-args exps env)
    (if (no-operands? exps)
	'()
	(cons (delay-it (first-operand exps) env) ;; 延时求值
	      (list-of-delayed-args (rest-operands exps)
				    env))))
    #+END_SRC
*** 修改 eval-if 
    条件表达式的谓词必须是应用序：
    #+BEGIN_SRC scheme
  (define (eval-if exp env)
    (if (true? (actual-value (if-predicate exp) env)) ;; 强迫求值“条件表达式的谓词”
	(eval (if-consequent exp) env)
	(eval (if-alternative exp) env)))
    #+END_SRC
*** 修改驱动循环
    输入的表达式必须立刻求值：
    #+BEGIN_SRC scheme
  (define (driver-loop)
    (prompt-for-input input-prompt)
    (let ((input (read)))
      (let ((output
	     (actual-value input the-global-environment))) ;; 强迫求值输入的表达式
	(announce-output output-prompt)
	(user-print output)))
    (driver-loop))
    #+END_SRC
