src/intepreter/lazy_evalutor.org
*** 槽
    _槽_ 作为 *数据结构* ，它实现了 *准备求值的安排* ：
    + *封装* 一个 _表达式_ 和一个 _环境_
    + 需要时可以求出表达式的值
    + 简单实现 *用一个表把 _表达式_ 和 _环境_ 包装起来* ：

    #+BEGIN_SRC scheme
  (define (delay-it exp env)
    (list 'thunk exp env))

  (define (thunk? obj)
    (tagged-list? obj 'thunk))
  (define (thunk-exp thunk) (cadr thunk))
  (define (thunk-env thunk) (caddr thunk))

  ;; (define thunk-object (delay-it '(+ 2 4) (setup-environment))) 
  ;; (thunk? thunk-object) ; => #t
  ;; (thunk-exp thunk-object) ; => (+ 2 4)
  ;; (thunk-env thunk-object)
  ;; => (((false true car cdr cons null? + >) #f #t (primitive #[compiled-procedure 17 ("list" #x1) #x1a #x184c3e2]) (primitive #[compiled-procedure 18 ("list" #x2) #x1a #x184c452]) (primitive #[compiled-procedure 19 ("list" #x3) #x14 #x184c4bc]) (primitive #[compiled-procedure 20 ("list" #x5) #x14 #x184c55c]) (primitive #[arity-dispatched-procedure 21]) (primitive #[arity-dispatched-procedure 22]))
    #+END_SRC

    强迫求值时应该用 _actual-value_ 而不是 _eval_ ，现在的 eval 是 *延时* 的
    + 强迫求值直到不是槽为止： _force-it_ 和 _actual-value_  *相互递归* 

    #+BEGIN_SRC scheme
  (define (force-it obj)
    (if (thunk? obj)
	(actual-value (thunk-exp obj) (thunk-env obj))
	obj))

  ;; (force-it 1) ; => 1
  ;; (force-it (delay-it '(+ 2 4) (setup-environment))) ; => 6 

  (define (actual-value exp env)
    (force-it (eval exp env)))

  ;; (actual-value '(+ 2 4) (setup-environment)) ; => 6

  ;; (define test-environment (setup-environment))
  ;; (define extended-env (extend-environment
  ;; 		      '(a b) 
  ;; 		      (list-of-delayed-args '(2 (/ 1 0)) test-environment)
  ;; 		      test-environment))
  ;; (lookup-variable-value 'b extended-env)
  ;;  => (thunk
  ;;      (/ 1 0)
  ;;      (((false true car cdr cons null? + >) #f #t (primitive #[compiled-procedure 14 ("list" #x1) #x1a #x19643e2]) (primitive #[compiled-procedure 15 ("list" #x2) #x1a #x1964452]) (primitive #[compiled-procedure 16 ("list" #x3) #x14 #x19644bc]) (primitive #[compiled-procedure 17 ("list" #x5) #x14 #x196455c]) (primitive #[arity-dispatched-procedure 18]) (primitive #[arity-dispatched-procedure 19]))))

  ;; (actual-value 'b extended-env) ;Unbound variable /
  ;; (force-it (eval 'b extended-env)) ;Unbound variable /
    #+END_SRC

**** 记忆槽
     通过修改槽对象来实现带记忆， *求值后将其换成得到的值表达式* ：

     #+BEGIN_SRC scheme
  (define (evaluated-thunk? obj)
    (tagged-list? obj 'evaluated-thunk))

  (define (thunk-value evaluated-thunk) (cadr evaluated-thunk))

  (define (force-it obj)
    (cond ((thunk? obj)
	   (let ((result (actual-value
			  (thunk-exp obj)
			  (thunk-env obj))))
	     (set-car! obj 'evaluated-thunk) ; 修改 trunk 为 evaluted-trunk 
	     (set-car! (cdr obj) result)  ; 修改表达式为求出的表达式
	     (set-cdr! (cdr obj) '())     ; 不再需要环境
	     result))
	  ((evaluated-thunk? obj)
	   (thunk-value obj))
	  (else obj)))

  ;; (define thunk-object (delay-it '(+ 2 4) (setup-environment)))
  ;; thunk-object 
  ;;  => (thunk (+ 2 4) (((false true car cdr cons null? + >) #f #t (primitive #[compiled-procedure 14 ("list" #x1) #x1a #x19643e2]) (primitive #[compiled-procedure 15 ("list" #x2) #x1a #x1964452]) (primitive #[compiled-procedure 16 ("list" #x3) #x14 #x19644bc]) (primitive #[compiled-procedure 17 ("list" #x5) #x14 #x196455c]) (primitive #[arity-dispatched-procedure 18]) (primitive #[arity-dispatched-procedure 19]))))

  ;; (force-it thunk-object) ; => 6
  ;; thunk-object ; =>  (evaluated-thunk 6)
  ;; (evaluated-thunk? thunk-object) ; => #t
  ;; (thunk-value thunk-object) ; => 6
  ;; (force-it thunk-object) ; => 6 
     #+END_SRC

     #+BEGIN_EXAMPLE
       无论有没有记忆，前面修改过的求值器都能工作
     #+END_EXAMPLE

