src/intepreter/lazy_evalutor.org
*** 测试
    测试延时求值器：
    #+BEGIN_SRC scheme
  (define the-global-environment (setup-environment))
  (driver-loop)
  ;;; L-Eval input:
  (define (try a b)
    (if (> a 0) 1 b))
  ;;; L-Eval value:
  ok
  ;;; L-Eval input:
  (try 0 (/ 1 0))
  ;;; L-Eval value:
  1
    #+END_SRC

* 应用

** 流
   #+BEGIN_EXAMPLE
     研究流计算的时候，流被实现为一种延时的表，其中用了特殊形式 delay 和 cons-stream。该方式的缺点：

     1. 需要用特殊形式，特殊形式不是一级对象，无法与高阶函数协作
     2. 流被做为与表类似但又不同的另一类对象，因此需要为流重新实现各种表操作，而且这些操作只能用于流
   #+END_EXAMPLE

   现在采用惰性求值，流和表就一样了，不再需要任何的特殊形式。只需 *要求 cons 为非严格* 的。做这件事有多种可能方式：
   + 修改求值器 _允许非严格的基本过程_ ，将 cons 实现为非严格过程
   + 把 cons 实现为 _复合过程_ 

   最简单的方式是用 *过程的方式表示序对* ：
   #+BEGIN_SRC scheme
  (define (cons x y)
    (lambda (m) (m x y)))

  (define (car z)
    (z (lambda (p q) p)))

  (define (cdr z)
    (z (lambda (p q) q)))

  ;; (define cons-procedure (cons 1 2))
  ;; cons-procedure ; => #[compound-procedure 13]

  ;; (car cons-procedure) ; => 1 
  ;; ((lambda (m) (m 1 2)) (lambda (p q) p)) ; => 1
  ;; ((lambda (p q) p) 1 2) ; => 1

  ;; (cdr cons-procedure) ; => 2 
   #+END_SRC

   基于这些基本操作，各种 _表操作的标准定义_ 不仅可以用于 _有穷的表_ ，也能自然地适用于 *无穷的惰性表* （ _流_ ）：
   #+BEGIN_SRC scheme
  (define (list-ref items n)
    (if (= n 0)
	(car items)
	(list-ref (cdr items) (- n 1))))

  (define (map proc items)
    (if (null? items)
	'()
	(cons (proc (car items))
	      (map proc (cdr items)))))

  (define (scale-list items factor)
    (map (lambda (x) (* x factor))
	 items))

  (define (add-lists list1 list2)
    (cond ((null? list1) list2)
	  ((null? list2) list1)
	  (else (cons (+ (car list1) (car list2))
		      (add-lists (cdr list1) (cdr list2))))))
   #+END_SRC

   定义整数流：
   #+BEGIN_SRC scheme :results output :exports result
  (define ones (cons 1 ones))
  (define integers (cons 1 (add-lists ones integers)))
   #+END_SRC
   #+RESULTS:
   : L-Eval input:
   : (list-ref integers 17) 
   : L-Eval value:
   :  18

   现在的表比前面的流更惰性：
   + 现在表的 car 部分也是延时的，同样直到需要用时才真正求值
   + 取序对的 car 或 cdr 时都不求值，其求值将延时到真正需要时：
     + 用作基本过程的参数
     + 需要打印输出

   惰性序对还能解决流引起的其他问题，讨论流的时候，处理包含了信息反馈的流时，需要显式使用 _delay_ 操作。而现在一切参数都是延时的，上述情况也不需要特殊处理了

   #+BEGIN_SRC scheme :results output :exports result
  (define (integral integrand initial-value dt)
    (define int
      (cons initial-value
	    (add-lists (scale-list integrand dt)
		       int)))
    int)

  (define (solve f y0 dt)
    (define y (integral dy y0 dt))
    (define dy (map f y))
    y)
   #+END_SRC

   #+RESULTS:
   : L-Eval input:
   : (list-ref (solve (lambda (x) x) 1 0.001) 1000)
   : L-Eval value:
   : 2.716923932235896
